Autodesk.Revit.DB.FilterElement.IsNameUnique(Autodesk.Revit.DB.Document,System.String)
Determines whether the given name could be applied to a new FilterElement,
or if it could not be applied because the name is already in use.
aDocument:
The document in which the name is being tested for uniqueness.
name:
The name tested for uniqueness.
Returns:
Returns true if the name is unique, and false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FilterElement.IsNameUnique(System.String)
Determines whether a potential filter element name is unique.
name:
The candidate name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FilterElement
The base class for filter elements in the document.
Since:
2011